backend/app/jobs/appointment_notification_job.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = '5700375f-6d17-4e5d-b32e-e5eb2cf55293' LIMIT 1
---
  def perform(appointment_id, action)
    appointment = Appointment.find(appointment_id)