backend/lib/tasks/mailers.rake

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = '7168cea9-97f9-4363-8864-544e6655eaee' LIMIT 1
---
  task :test, %i[email_type appointment_id] => :environment do |_, args|
    email_type = args[:email_type] || 'confirmation'
    appointment_id = args[:appointment_id]

    unless appointment_id
      # Find a random accepted appointment if none specified
      appointment_id = Appointment.accepted.order('RANDOM()').first&.id

      unless appointment_id
        puts 'ERROR: No accepted appointments found and no appointment_id provided.'
        puts 'Please create an appointment or specify an appointment_id.'
        exit 1
      end
    end

    begin
      appointment = Appointment.find(appointment_id)

SELECT "appointments".* FROM "appointments" ORDER BY "appointments"."created_at" DESC LIMIT 10
SELECT 1 AS one FROM "appointments" LIMIT 1
---
  task list_appointments: :environment do
    appointments = Appointment.includes(nutritionist_service: %i[nutritionist
                                                                 service]).order(created_at: :desc).limit(10)

    if appointments.any?