backend/app/services/create_appointment_service.rb

  def perform
    guest = Guest.find_or_create_by!(email: appointment_params[:guest_email]) do |g|
---
INSERT INTO "appointments" ("guest_id", "nutritionist_service_id", "state", "event_date", "created_at", "updated_at") VALUES ('d858de2a-371f-4eed-856b-c428a7dc01e9', 'da0b4a26-0a94-41f8-b3a9-acfd51ab6873', 0, '2025-08-28 00:00:00', '2025-08-04 15:13:27.807161', '2025-08-04 15:13:27.807161') RETURNING "id"
INSERT INTO "guests" ("name", "email", "created_at", "updated_at") VALUES ('Artur Leite', 'arturleite@email.com', '2025-08-04 15:13:27.789122', '2025-08-04 15:13:27.789122') RETURNING "id"
SELECT "guests".* FROM "guests" WHERE "guests"."email" IS NULL LIMIT 1