backend/app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("guest_id", "nutritionist_service_id", "state", "event_date", "created_at", "updated_at") VALUES ('d858de2a-371f-4eed-856b-c428a7dc01e9', 'da0b4a26-0a94-41f8-b3a9-acfd51ab6873', 0, '2025-08-28 00:00:00', '2025-08-04 15:13:27.807161', '2025-08-04 15:13:27.807161') RETURNING "id"
---
  def create
    result = CreateAppointmentService.new(appointment_params).perform
    if result.success?
      render json: {
        message: I18n.t('api.appointments.created'),
        appointment: ActiveModelSerializers::SerializableResource.new(result.appointment, serializer: AppointmentSerializer)