backend/app/controllers/nutritionists_controller.rb

  def appointments
    appointments = @nutritionist.appointments.includes(:guest)
---
SELECT "appointments".* FROM "appointments" INNER JOIN "nutritionist_services" ON "appointments"."nutritionist_service_id" = "nutritionist_services"."id" WHERE "nutritionist_services"."nutritionist_id" = '0438ea71-83bf-4190-aeda-841a717ee061'

  def set_nutritionist
    @nutritionist = Nutritionist.find(params[:id])
---
SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" = '0438ea71-83bf-4190-aeda-841a717ee061' LIMIT 1