backend/app/controllers/nutritionist_services_controller.rb

  def index
    page = (params[:page] || 1).to_i
    per_page = (params[:per_page] || 10).to_i

    cache_key = "nutritionist_services:index:search:#{params[:search]}:location:#{params[:location]}:page:#{page}:per_page:#{per_page}"

    result = Rails.cache.fetch(cache_key, expires_in: 15.minutes) do
      # Get filtered services using existing scopes
      filtered_services = NutritionistService.search_by_nutritionist_or_service(params[:search])
                                             .filter_by_location(params[:location])
                                             .includes(:nutritionist, :service, :location)

      # Get unique nutritionist IDs from filtered services - without ordering to avoid PostgreSQL DISTINCT issue
      nutritionist_ids = filtered_services.distinct.pluck(:nutritionist_id)

      # Count for pagination is based on number of nutritionists
      total_count = nutritionist_ids.length
      total_pages = (total_count.to_f / per_page).ceil

      paginated_nutritionist_ids = nutritionist_ids.slice((page - 1) * per_page, per_page) || []

      nutritionists = Nutritionist.where(id: paginated_nutritionist_ids).order(:name)

      nutritionist_services = filtered_services
                              .where(nutritionist_id: paginated_nutritionist_ids)
                              .to_a

      grouped_services = nutritionist_services.group_by(&:nutritionist_id)

      nutritionists_with_services = nutritionists.map do |nutritionist|
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" IN ('72e03d46-146c-4e33-bb1e-09187767873c', '281259d4-12b6-4485-a20f-d74b1adabafa', '04ce9998-f8ce-4646-8828-19c5660980ad', 'b1111ace-c4fe-4856-9ea0-b7b91c0c0fd3', '2a912639-2d72-4750-925f-b393b2ec2d27', '1e9c5326-f335-4459-a942-568d11aa3605', 'cd89948d-dfec-4283-82d4-7a52c5398b54', 'b7409c2e-f187-4ecc-8537-45597cd0dc35')
SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" IN ('accc36c7-373e-4663-b522-11bc89f17d82', '27828aa9-0d00-4c8d-9d25-41188ee8082f', 'c70a881c-e643-4c3a-a6b0-fffda8e46f6c', 'c89a4ebb-e009-49ad-bbe9-96b77f5f554f', 'e295d9ab-df96-46a2-add8-5acb2ea6b3cd', '03ace15f-6eaa-49c8-a7ec-967572a799c8', 'd472a0fe-88a8-4ad1-9bd4-f949f66f8580', '6314d436-af5a-4f3c-a6ff-8c72f5ca4f6d', '3b9eb6d2-de09-467c-9ae9-0c495847d596', '459a33d4-e5f4-4ab2-b0b7-bdf3d7b48222', '78906122-6d93-43fc-9fd9-cdbbdb03a278', 'a38d17db-c39d-4b58-8fe4-bd63817f7859')
SELECT "services".* FROM "services" WHERE "services"."id" IN ('6faf170a-ff5c-4d93-9d77-0c3082d8ed1a', '2dc8b226-66a3-4984-9e1d-1013c0ca8a4f', '38e0e4b2-050d-471b-917f-24ce83baf334', '842d2465-855c-424c-8b90-1ec6e9ae32fd', '31e191bb-72b3-4567-b7f9-fb458aaf7a53', '80edb929-e9cd-42f3-a0ac-5e85dde21f20', '152fdcfb-481b-47b0-812d-5eba6319ec95', '8430828b-d869-4c4b-b6be-b71f45f3e61b', 'f3a70056-0cad-4baf-b463-dadbbbf6c2f9', '47a9c0fc-3a21-4a83-9c59-8e3673fae656', 'dff06707-9327-4960-955c-2143d837e982', 'f8efc8ec-458d-4e3c-97eb-d1895ac53e39')
SELECT DISTINCT nutritionist_services.*, nutritionists.name as nutritionist_name, services.name as service_name, locations.id as location_id, locations.city, locations.full_address FROM "nutritionist_services" INNER JOIN "nutritionists" ON "nutritionists"."id" = "nutritionist_services"."nutritionist_id" INNER JOIN "services" ON "services"."id" = "nutritionist_services"."service_id" INNER JOIN "locations" ON "locations"."id" = "nutritionist_services"."location_id" WHERE (nutritionists.name ILIKE '%Maria%' OR services.name ILIKE '%Maria%')
SELECT "locations".* FROM "locations" WHERE "locations"."id" = '2a912639-2d72-4750-925f-b393b2ec2d27' LIMIT 1
SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" = 'accc36c7-373e-4663-b522-11bc89f17d82' LIMIT 1
SELECT "services".* FROM "services" WHERE "services"."id" = '2dc8b226-66a3-4984-9e1d-1013c0ca8a4f' LIMIT 1